Simulations/cylinder2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          152;
        startFace       69094;
    }
    outlet
    {
        type            patch;
        nFaces          152;
        startFace       69246;
    }
    topAndBottom
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          444;
        startFace       69398;
    }
    left
    {
        type            empty;
        inGroups        1(empty);
        nFaces          34764;
        startFace       69842;
    }
    right
    {
        type            empty;
        inGroups        1(empty);
        nFaces          34764;
        startFace       104606;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       139370;
    }
)

// ************************************************************************* //
